'use strict';

/**
 * 验证规则
 * @type {Object}
 */
var regx = {
  url: /^((https|http):\/\/)(www\.)?[-a-zA-Z0-9@:%._\+~#=]{2,256}\.[a-z]{2,6}\b([-a-zA-Z0-9@:%_\+.~#?&\/\/=]*)/,
  email: /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  phone: /^(([0\+]\d{2,3}-)?(0\d{2,3})-)?(\d{7,8})(-(\d{3,}))?$/,
  mobile: /^1[3|4|5|6|7|8|9][0-9]{1}[0-9]{8}$/,
  qq: /[1-9][0-9]{4,}/,
  postCode: /[1-9]\d{5}(?!\d)/,
  ip: /((2[0-4]\d|25[0-5]|[01]?\d\d?)\.){3}(2[0-4]\d|25[0-5]|[01]?\d\d?)/,
};

module.exports = {
  /**
   * 统一验证函数
   * @param {String} value - 被验证的值
   * @param {String} type  - 被验证的类型
   * @returns {Boolean}
   */
  validate: function(value, type) {
    return regx[type].test(value);
  },
};
